import WishCard from "../WishCard/WishCard";
import ImageSlider from "../Slider/ImageSlider/ImageSlider";
import DigitalCard from "../DigitalCard/DigitalCard";
import VideoPlayer from "../VideoPlayer/VideoPlayer";
import TitleTextSection from "../TitleTextSection/TitleTextSection";
import ImageCard from "../ImageCard/ImageCard";
import Timer from "../Timer/Timer";

export default function Main() {
    return (
        <div className="main">
            <ImageCard src={`/image/mochamilk/mm1.jpg`} alt={`mochamilk1`}/>
            <TitleTextSection text={`Как я мог начать говорить о нас, не начав с нас да`}/>
            <WishCard text={`Сұлулығыңның алдында жығыламын <br>
                                Сенің аураң – солтүстік шұғыла <br>
                                Жарық шығаратын ұлы мұңымнан`}/>
            <ImageSlider title={``}/>
            <TitleTextSection text={`С тобой каждый день — это праздник, а сегодня этот праздник для тебя!
                    С днем рождения, Чокопайым сладкая`}/>
            <ImageCard src={`/image/mochamilk/mm2.jpg`} alt={`mochamilk`}/>
            <TitleTextSection text={`Совсем скоро это будем мы хихи &#9992;&#128158;`}/>
            <WishCard text={`Есірткідей қанымнан <br>
                    Жан болдың ғой табылған <br>
                    Сүйіп өтем тек сені <br>
                    Өшіре алмай жадымнан &#128523`}/>
            <TitleTextSection text={`Желаю тебе только счастья, любви и исполнения всех самых заветных желаний!`}/>
            <DigitalCard/>
            <TitleTextSection text={`Хотя, зная нас вххвх, мы можем быть и такими (шутка &#128523)`}/>
            <ImageCard src={`/image/mochamilk/mm3.jpg`} alt={`mochamilk3`}/>
            <TitleTextSection text={`Менің кішкентай ғана әлемім, осыған қарамастан сенімен біз махаббат пен бақытқа толы үүүлкен әлем құрай алдық &#127758; 
             Өзіңмен өткен әр мезетіме рахмет айтамын &#128151; &#128591;`}/>
            <ImageCard src={`/image/airport/airport1.jpg`} alt={`airport1.jpg`}/>
            <Timer title={`Осталось до встречи:`} targetDate={'2024-12-21T09:50:00Z'}/>
            <ImageCard src={`/image/airport/airport2.jpg`} alt={`airport2.jpg`}/>
            <WishCard text={`It's so sweet, knowing that you love me <br>
                Though we don't need to say it to each other, sweet <br>
                Knowing that I love you, and running my fingers through your hair <br>
                It's so sweet`}/>
            <TitleTextSection text={`Жаным сол менің кішкентай ғана, сені қатты қатты сағындым :(
            Внизу наконец то долгожданное видео, надеюсь понравится. Эта песня уже заела в голове, но мне нравится.
            Ведь теперь я всегда буду видеть тебя каждый раз когда буду слышать хихи. Приянтого просмотра жаным!`}/>
            <VideoPlayer/>
            <WishCard text={`я тебя так сильно люплю пананчик мои`}/>
            <ImageCard src={`/image/airport/waiting.jpg`} alt={`waiting.jpg`}/>
            <TitleTextSection text={`А теперь тебя ждет финальная версия этой странички, скорее кликай`}/>
            <WishCard id="finally-text" text={`Жаным менің, вот и наконец то спустя дооолгое время (3 дня) и тебе исполнилось
             20 лет🥺🤍 Құрдас хехе😋  В этот знаменательный день хочу пожелать тебе крепкого здоровья, чтобы 
             никогда не болела; чистого неба над головой, чтобы дышалось хорошо легко; и много много денег, чтобы
             была возможность осуществить все свои хотелки🥺🤍🙏🏻 Двадцать это всего лишь число, а на дела ты моя
             маленькая девочка, бэйбик мой🥺🎀 Жақсы көремін сені🤍 Желаю всегда находиться в тепле, иметь теплые,
             милые носочки и самые самые стильные одежды😋😎 Никогда не думай о плохом и не грусти жаным🥺 Если есть 
             сожаления в прошлом, то пусть и останутся в прошлом. В новое десятилетие в новом духе🥺🙏🏻 Обязательно
             кушай и не пропускай приемы пищи, мы тут с мамой переживаем очень сильно🥺🤍 Такая умничкам, сама
             справляется в другой стране, горжусь очень сильно 🥺😋💗🙏🏻 Не грусти о том, что на дне рождении меня
             нет рядом😔 За то ты в корее, сама своими силами😎🙏🏻 Когда еще будешь отмечать день рождения так. Құдай
             құдай бере салған өзің🥺😋🤍🌎🙏🏻 К сожалению, мне было тяжело найти и отправить подарок в корее😭 
             поэтому надеюсь, что хотя бы эта страничка тебе очень понравилась😔😇🫂. Учимся, не забываем делать
             перерыв и не перенапрягаться🤍🙏🏻 Почаще погулять в корее и сделать оченьочень много красивых фото для 
             моей галереи😋✨🇰🇷 Осталось та уже совсем чуток, поэтому дотерпим обязательно🥺🤍🙏🏻🙏🏻 мы же умнички🤍 За то
             оставшееся время желаю провести в радости и комфорте май айпад герл😭😭😭🤍🤍 Анау стикерді көріп тұрмын
             бубу шашын түйіп қойып жатқан вхвх😇Еще много о чем хочется говорить, да и уже говорил в прошлых поздравлениях,
             ты самое главное помни и не забывай о них🥺🤍 Будь аккуратнее и береги себя 🥺🤍🙏🏻 Я тааак тебя люблю alku’s diana
             🥺🤍🙏🏻🌎 моя самая самая сладкая, нежная, красивая и смешная, милая и прекрасная чоко-вупипапайная,
             карамельно-фисташковая, клубично-чудная любимая🥺🤍🌎💗🍼🧸🍓🐾🤎🚗🎀✨🙏🏻😋😎🐥🥺 Еще раз поздравляю 
             с днем рождения, жарқыным!🥺🤍Люблю очень сильно фсьо давай✨💗🎀`}/>
            <TitleTextSection text={`чувствую после этого будет так`}/>
            <ImageCard src={`/image/mochamilk/mm4.jpg`} alt={`mochamilk4`}/>
        </div>
    )
}